tap "github/gh"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "wistia/dub", "https://github.com/wistia/dub"

# Install GNU core utilities (those that come with macOS are outdated)
brew "coreutils"

# GNU `find`, `locate`, `updatedb`, and `xargs`, g-prefixed
brew "findutils"

# some other useful utilities like `sponge`, `errno`
brew "moreutils"

brew "ack"
brew "autoconf"
brew "asdf"
# brew "bash"
# brew "bash-completion@2"
brew "cloc"
brew "cmake"
brew "dnsmasq", restart_service: true
brew "dockutil"
brew "elixir"
brew "erlang"
brew "ffmpeg"
brew "gcc"
brew "gh"
# brew "gifsicle"
brew "git"
brew "git-lfs"
brew "gnu-sed"
brew "gnupg"
brew "gnutls"
brew "grep"
brew "haproxy"
brew "id3lib"
brew "krb5"
brew "ldns"
brew "libfido2"
brew "libxml2"
brew "mariadb@10.2"
brew "mas"
brew "memcached"
brew "mysql@5.6", restart_service: true
brew "ncdu"
# brew "ncurses"
brew "nmap"
# brew "node"
brew "nsq"
brew "nvm"
brew "openssh"
# brew "overmind"
brew "pandoc"
brew "pcre"
brew "postgresql"
brew "protobuf"
brew "pyenv"
brew "ruby-build"
brew "rbenv"
brew "redis"
brew "rename"
# brew "ruby"
brew "screen"
# brew "sqlite"
brew "srt"
brew "tldr"
brew "tmux"
brew "trash"
brew "tree"
brew "vim"
brew "watch"
brew "watchman"
brew "wget"
brew "wxmac"
brew "yarn"
brew "youtube-dl"
brew "heroku/brew/heroku"
brew "wistia/dub/wistia-dub"

# cask "adoptopenjdk8"
cask "android-studio"
cask "appcleaner"
# cask "arduino"
# cask "balenaetcher"
cask "chromedriver"
cask "cyberduck"
cask "docker"
cask "dropbox"
cask "evernote"
cask "firefox"
# cask "garmin-basecamp"
cask "google-chrome"
# cask "google-earth-pro"
# cask "handbrake"
cask "insomnia"
cask "iterm2"
cask "keepingyouawake"
cask "licecap"
cask "macdown"
# cask "microsoft-auto-update"
# cask "microsoft-edge"
cask "mysqlworkbench"
# cask "ngrok"
# cask "prusaslicer"
cask "selfcontrol"
cask "sequel-pro"
cask "sketch"
cask "slack"
cask "spotify"
cask "tableplus"
cask "tuple"
cask "vagrant"
cask "virtualbox"
cask "viscosity"
cask "visual-studio-code"
# cask "vlc"
cask "xquartz"
cask "zoom"

# App Store packages
mas "ColorSlurp", id: 1287239339
mas "Navicat Essentials for PostgreSQL", id: 466725643
