tap "github/gh"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"

# Install GNU core utilities (those that come with macOS are outdated)
brew "coreutils"

# GNU `find`, `locate`, `updatedb`, and `xargs`, g-prefixed
brew "findutils"

# For handy tools like "chronic" and "parallel"
brew "moreutils"

# install the rest of the binaries...
brew "ack"
brew "act"
brew "actionlint"
brew "autoconf"
brew "aws-vault"
brew "awscli"
brew "bat"
brew "cloc"
brew "cmake"
brew "curl"
brew "dnsmasq"
brew "dockutil"
brew "ffmpeg"
brew "findutils"
brew "gcc"
brew "gh"
brew "git"
brew "git-lfs"
brew "gnu-sed"
brew "gnupg"
brew "gnutls"
brew "grep"
brew "haproxy"
brew "hivemind"
brew "http-server"
brew "hyperfine"
brew "id3lib"
brew "imagemagick"
brew "jpeg"
brew "jq"
brew "just"
brew "kubectl"
brew "kubectx"
brew "mas"
brew "moreutils"
brew "nginx"
brew "nmap"
brew "openssh"
brew "pandoc"
brew "postgresql@14"
brew "pyenv"
brew "redis"
brew "rename"
brew "ripgrep"
brew "screen"
brew "svgo"
brew "tldr"
brew "tmux"
brew "trash"
brew "tree"
brew "vim"
brew "watch"
brew "watchman"
brew "wget"
brew "yamllint"
brew "yarn"
brew "youtube-dl"

# install apps
cask "1password"
cask "1password-cli"
cask "android-studio"
cask "appcleaner"
cask "chromedriver"
cask "cyberduck"
cask "docker"
cask "dropbox"
cask "figma"
cask "firefox"
cask "flux"
cask "google-chrome"
cask "imageoptim"
cask "insomnia"
cask "iterm2"
cask "keepingyouawake"
cask "licecap"
cask "macdown"
cask "meld"
cask "ngrok"
cask "notion"
cask "omnidisksweeper"
cask "pika"
cask "proxyman"
cask "selfcontrol"
cask "session-manager-plugin"
cask "sketch"
cask "slack"
cask "spotify"
cask "tableplus"
cask "tinypng4mac"
cask "tuple"
cask "viscosity"
cask "visual-studio-code"
cask "vlc"
cask "xquartz"
cask "zoom"

# other apps I may want
# cask "arduino"
# cask "balenaetcher"
# cask "garmin-basecamp" # deleted from homebrew?
# cask "google-earth-pro"
# cask "handbrake"
# cask "prusaslicer"
# cask "tinymediamanager"

# App Store packages
# mas "Xcode", id: 497799835
