tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"

# Install GNU core utilities (those that come with macOS are outdated)
brew "coreutils"

# GNU `find`, `locate`, `updatedb`, and `xargs`, g-prefixed
brew "findutils"

# some other useful utilities like `sponge`, `errno`
brew "moreutils"

# Bash 4
brew "bash"
brew "bash-completion2"

brew "ack"
brew "dockutil"
brew "git"
brew "git-lfs"
brew "gnu-sed"
brew "grep"
brew "libxml2"
brew "mas"
brew "memcached"
brew "mysql"
brew "nmap"
brew "nvm"
brew "openssh"
brew "openSSL"
brew "postgresql"
brew "pyenv"
brew "rbenv"
brew "readline"
brew "redis"
brew "rename"
brew "ruby-build"
brew "screen"
brew "sqlite"
brew "trash"
brew "tree"
brew "vim"
brew "watch"
brew "watchman"
brew "wget"
brew "yarn"
brew "youtube-dl"

cask "android-studio"
cask "appcleaner"
cask "balenaetcher"
cask "chromedriver"
cask "cyberduck"
cask "docker"
cask "dropbox"
cask "evernote"
cask "firefox"
cask "google-chrome"
cask "insomnia"
cask "iterm2"
cask "keepingyouawake"
cask "licecap"
cask "macdown"
cask "selfcontrol"
cask "slack"
cask "spotify"
cask "viscosity"
cask "visual-studio-code"
cask "xquartz"
cask "zoomus"

mas "com.apple.dt.Xcode", id: 497799835
mas "com.prect.NavicatEssentialsForPostgreSQL", id: 466725643
